In [112]:
import sklearn
from matplotlib import pyplot as plt
import pandas as pd
import numpy as np

In [113]:
data=pd.read_excel("stock_data.xlsx")

In [114]:
data

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0           n.a.
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [115]:
data.isnull().any(axis=0)

tickers    False
eps         True
revenue    False
price       True
people     False
dtype: bool

In [116]:
data["eps"].fillna(0,inplace=True)

In [117]:
x=data["price"].mean()

In [118]:
data["price"].fillna(x,inplace=True)

In [119]:
data

  tickers    eps  revenue    price         people
0   GOOGL  27.82       87   845.00     larry page
1     WMT   4.61      484    65.00           n.a.
2    MSFT  -1.00       85    64.00     bill gates
3    RIL    0.00       50  1023.00  mukesh ambani
4    TATA   5.60       -1   499.25     ratan tata

In [120]:
d1=pd.get_dummies(data["tickers"])
d2=pd.get_dummies(data["people"])

In [121]:
d1

   GOOGL  MSFT  RIL   TATA  WMT
0      1     0     0     0    0
1      0     0     0     0    1
2      0     1     0     0    0
3      0     0     1     0    0
4      0     0     0     1    0

In [122]:
d2

   bill gates  larry page  mukesh ambani  n.a.  ratan tata
0           0           1              0     0           0
1           0           0              0     1           0
2           1           0              0     0           0
3           0           0              1     0           0
4           0           0              0     0           1

In [123]:
data1=pd.concat([data,d1,d2],axis=1)

In [124]:
data1

,tickers,eps,revenue,price,people,GOOGL,MSFT,RIL,TATA,WMT,bill gates,larry page,mukesh ambani,n.a.,ratan tata
0,GOOGL,27.82,87,845.00,larry page,1,0,0,0,0,0,1,0,0,0
1,WMT,4.61,484,65.00,n.a.,0,0,0,0,1,0,0,0,1,0
2,MSFT,-1.00,85,64.00,bill gates,0,1,0,0,0,1,0,0,0,0
3,RIL,0.00,50,1023.00,mukesh ambani,0,0,1,0,0,0,0,1,0,0
4,TATA,5.60,-1,499.25,ratan tata,0,0,0,1,0,0,0,0,0,1

In [125]:
#pip install word2number

In [126]:
#from word2number import w2n

In [127]:
#data1["eps"]=data1["eps"].map(w2n.word_to_num)
#data1

In [128]:
data1.drop(["tickers","eps","price","people"],axis=1,inplace=True)

In [129]:
data1

,revenue,GOOGL,MSFT,RIL,TATA,WMT,bill gates,larry page,mukesh ambani,n.a.,ratan tata
0,87,1,0,0,0,0,0,1,0,0,0
1,484,0,0,0,0,1,0,0,0,1,0
2,85,0,1,0,0,0,1,0,0,0,0
3,50,0,0,1,0,0,0,0,1,0,0
4,-1,0,0,0,1,0,0,0,0,0,1

In [130]:
x=data1.drop(["revenue"],axis=1)
y=data1["revenue"]

In [131]:
from sklearn.linear_model import LinearRegression

In [132]:
model=LinearRegression()

In [133]:
model.fit(x,y)

LinearRegression()

In [134]:
model.score(x,y)

1.0